JM Provision plan

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_JM_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_JM_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_JM_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_JM_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_JM_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_JM_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_conversations_chat_transfer_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_conversations_chat_transfer_workflow_sid" {
        id             = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/conversations_chat_transfer_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/conversations_chat_transfer_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/conversations_chat_transfer_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC9fd261078d40fcfa06f0e374921af7a5/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isContactlessTask==true OR helpline=='SafeSpot' OR channelType=='web' OR to=='+14244147346' OR to=='+18767287042' OR twilioNumber=='instagram:17841444523369053' OR twilioNumber=='messenger:107246798170317'"
                            filter_friendly_name = "SafeSpot"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQa4103558b653833e5ac4a7beff5642dc"
                                },
                            ]
                        },
                        {
                            expression           = "channelType=='web' AND e2eTestMode=='true'"
                            filter_friendly_name = "E2E Test"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQ5a8b2e20d37b37d4493eaf7183f14f5c"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS4c9446c18e9ec8572cdc0f1a5fed82b0/WWfcce7a359778f5ab533e7345244079e0"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["queue_transfers"] will be created
  + resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      + assignment_callback_url          = (known after apply)
      + configuration                    = jsonencode(
            {
              + task_routing = {
                  + filters = [
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ5a8b2e20d37b37d4493eaf7183f14f5c'"
                          + filter_friendly_name = "e2e_test"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ5a8b2e20d37b37d4493eaf7183f14f5c"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQa4103558b653833e5ac4a7beff5642dc'"
                          + filter_friendly_name = "master"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQa4103558b653833e5ac4a7beff5642dc"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQebe874b8f4dd2e88e664970bee44af6a'"
                          + filter_friendly_name = "survey"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQa4103558b653833e5ac4a7beff5642dc"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      + fallback_assignment_callback_url = (known after apply)
      + friendly_name                    = "Queue Transfers Workflow"
      + id                               = (known after apply)
      + re_evaluate_tasks                = (known after apply)
      + sid                              = (known after apply)
      + task_reservation_timeout         = (known after apply)
      + workspace_sid                    = "WS4c9446c18e9ec8572cdc0f1a5fed82b0"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQebe874b8f4dd2e88e664970bee44af6a"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS4c9446c18e9ec8572cdc0f1a5fed82b0/WW096aa9a9fedf7a2926b182d909a13a19"
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WWfcce7a359778f5ab533e7345244079e0" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master          = "WWfcce7a359778f5ab533e7345244079e0" -> (known after apply)
      + queue_transfers = (known after apply)
      ~ survey          = "WW096aa9a9fedf7a2926b182d909a13a19" -> (known after apply)
    }
